{
  "questions": [
    {
      "question": "Why are you the best fit for this position.",
      "prepAnswers": [
        {
          "employers": ["ASU-Packaging"],
          "answerPoints": [
            "Why I feel that I am the best fit for this position? Research wise, my most recent works at Colubmia University have extensively used or contributed to several of the key areas mentioned in the job description, including 2.5D/3D integration, flip-chip bonding, advanced packaging, PCB layout and board assembly. Among some other technologies that I have not directly worked on, I also have plans to explore the use of those in my future research, like hybrid bonding, more heterogeneous integration with different materials, and building predictive models, or digital twins, for advanced packaing.",
            "Let me get into a bit more details. In my recent work that is published in IEEE Transactions on Components, Packaging and Manufacturing Technology, I led the design of an integrated photonic chip to provide high-bandwidth and energy-efficient data input/output to computing chips. This photonic chip was designed to be 3D-integrated with an electronic driver chip using flip-chip bonding, with a \\textmu{}bump pitch down to 25\\,\\textmu{}m. Three of these electronic-photonic chip assemblies are further co-packaged with an Intel FPGA in a 2.5D fashion, using Intel's EMIB technology. What's special here is the placement of the photonic chip in an open cavity in the substrate, which requires the photonic wafer to be thinned down to about 100\\,\\textmu{}m before dicing. Altogether this package delivers a 96\\,Tbps bidirectional bandwidth with a 4\\,Tbps/mm shoreline bandwidth density, and consumes less than 1\\,pJ/b. This represents a two-order-of-magnitude improvement over the state-of-the-art in terms of the product of bandwidth density and energy efficiency. And I'd like to point out that this was really a collaborative, inter-disciplinary, co-design effort that involved a lot of design for packaging considerations.",
            "I can go into more details about this work later if you are interested. But before that, I'd also like to mention one of my future research directions that I think would highly benefit from heterogeneous integration and advanced packaging. This direction aims to break away from the density limitations of today's planar optical routing, and explore the possibility of routing optical signals in the 3rd dimension. This can enable a new connectivity paradigm where more chips can be integrated onto a big photonic substrate, and can be potentially very useful for enabling wafer-scale or panel-scale computing. And I think technologies like hybrid bonding can be used to bond the active chips and the routing chip, because it A) provides dense electrical paths for control signals, and B) achieves the alignment accuracy and mechanical stability to minimize the optical loss due to misalignment. Another very interesting option to look into is the use of a glass substrate, because of its transparency to light and the ability to fabricate in large panels.",
            "Besides research, I am also excited about teaching, and one of my goals is to develop a course on integrated photonics, where eventually I hope to bring in hands-on design experiences and tape-out opportunities for the students, like some of the electronic circuit courses already have.",
            "I also value entrepreneurship, as mentioned in the job description. I personally have helped write several patents, and I have closely worked with a few start-up companies in research projects and proposals.",
            "Also important to me is that I have mentored several undergraduate and graduate students, in teaching them how to do, for example, PCB layout for packaging and testing, and how to make equivalent circuit models for photonic devices to be used in electronic-photonic co-simulation.",
            "I hope all these experiences make me a great fit for this position, and I am happy to answer any questions you may have."
          ]
        }
      ],
      "askedBy": [
        {
          "name": "ASU-Packaging",
          "date": "1/10/2024"
        }
      ]
    },
    {
      "question": "Research overview / accomplishments / future plans.",
      "prepAnswers": [
        {
          "employers": [
            "UMN",
            "ASU-Microelectronics",
            "ASU-Packaging",
            "RIT-Photonics",
            "Clemson"
          ],
          "answerPoints": [
            "\\textbf{Opening}",
            "Thank you for your kind introduction.",
            "I am happy to give an overview of my research work using integrated silicon photonics to address the communication bottleneck in computing systems.",
            "By communication bottleneck I mean that today's link technologies are consuming too much energy to provide not even enough bandwidth among computing nodes. This high use of energy and low bandwidth are causing a slowing down of large-scale computational tasks. This slowing down is the bottleneck that limits the performance of applications like AI and machine learning.",
            "This bottleneck also prevents the system from being able to scale and support a wide spectrum of real-world applications like climate modeling, drug discovery, banking, digital twins, and defense applications.",
            "So my work directly addresses this bandwidth and energy problem.",
            "\\textbf{First Work}",
            "Let me tell you about one area of my work. Here, I have focused on bringing photonic technologies into the computing socket to replace today's electrical data input/output. This approach is significant because electrical wires start to consume too much energy when data needs to be sent far away. And by converting data into the optical domain within the socket, it can travel longer distances with higher bandwidth and lower energy.",
            "To achieve this, I designed a photonic integrated circuit, that goes into a package like this. This package delivers a 96\\,Tbps bidirectional bandwidth with a 4\\,Tbps/mm bandwidth density, and consumes less than 1\\,pJ/b. So if we multiply bandwidth density with energy efficiency, we get an impressive metric. This metric is two orders of magnitude better than the state-of-the-art, which means that we can greatly improve both the bandwidth density and the energy efficient at the same time.",
            "Under the hood, I designed the three photonic chips here, each bonded to an electronic driver chip designed by Cornell University, and co-packaged with an Intel FPGA chip sitting right next to the photonic data input/output. This tight integration between the computing chip and the photonic interface is the key to minimizing the extra wiring between the two, which has been a big source of energy consumption in today's systems.",
            "Each photonic chip that I am showing here integrates over 2,000 photonic devices, like these microresonator modulators and filters, into this small 8 mm by 8 mm footprint. This small form factor is what enables the high bandwidth density, and is only possible with the use of 3D integration of electronics and photonics. As you can see here, this chip was really designed with integration and packaging in mind.",
            "To maximize the bandwidth that this photonic chip delivers, I developed a link architecture that greatly increases the number of parallel wavelength channels per link, from today's less than 16 to greater than 64. What it really enables is to achieve a high aggregate data rate while requiring only a moderate data rate per channel. This is what makes the low energy consumption.",
            "The technology is called comb-driven dense wavelength-division multiplexing. As I am showing here, the link is driven by an optical frequency comb source based on the non-linear Kerr effect in Silicon Nitride. It can generate tens to hundreds of wavelength channels from a single laser. Such a high channel count is not feasible if using one individual laser for each channel. All these wavelengths can carry different streams of data and propagate in the same waveguide or fiber.",
            "To encode data onto each of these wavelengths, I use a series of microresonator modulators on the transmitter side. Each modulator only interacts with one wavelength, without affecting the others. The receiver side is similar, but with microresonator filters to separate the wavelengths onto individual photodetectors.",
            "Now if I zoom in and show some details of this architecture, this is how I was able to scale up the channel count beyond 64. It is by using these special interleaving structures that split the wavelengths on to multiple buses, and then recombine them after they're modulated. So, this architecture relaxes the communication bottleneck by enabling scalable bandwidth at low energy consumption.",
            "\\textbf{Second Work}",
            "Now, let me talk about a second area of my work. Here, I have focused on enabling computing functionalities within data movement. This approach reduces the amount of data that needs to be shuttled back and forth between the computing and memory units. This shuttling of data has become a major energy and performance bottleneck in applications that require frequent memory access.",
            "What I am showing here is a concept of a photonic architecture that I proposed to accelerate multiply-accumulate, or MAC operations. MAC operations are fundamental to matrix multiplcation, and it is prevailing in AI and machine learning workloads. Here, by putting this photonic architecture beneath the memory cell, it can perform MAC operations near memory, as opposed to sending data to the computing unit for processing and retrieving the results back. And this photonic MAC engine can be integrated into the same chip as the photonic data I/O, essentially combining data processing with data movement.",
            "So, here is how this architecture works, and how it addresses the limitations of some existing photonic MAC implementations. Let's say we want to do this 4-bit MAC operation. Traditionally, we would send these numbers to a GPU, do the computation there, and then get the result back. We don't want to do that. There are also some existing photonic MAC implementations, either based on cascaded Mach-Zehnder interferometers or microring weight banks. But they typically encode data into an analog optical property, like phase or intensity. So these approaches A) require extra steps to convert these numbers into analog signals to drive the photonic components, and B) are limited in bit precision since photonic devices are very sensitive to fabrication and environmental purturabations.",
            "In my approach, I address these limitations by keeping the multipliers and multiplicands in the digital domain. And then I leverage the high wavelength parallelism that I have been pushing in my first work, and assign each of these bit places a unique wavelength. Each bit place drives a microresonator modulator in a digital fashion, either let the light pass or block it. So, with this analog photodetector, we can instantaneously get the number of ones in this bit place, and this will be converted to the partial result for this bit place and the carry bits to higher bit places.",
            "I also proposed to do this conversion from analog to digital in the optical domain, because it is very challenging to design a fast and energy-efficient electrical ADC with a high bit count. So here, I use the signal from the analog PD to drive a series of microresonator modulators which are biased incrementally away from their resonance. This way, the same driving voltage will flip only a subset of these modulators, depending on the voltage level.",
            "And finally, this approach can retain the full precision of the input data, as long as we have enough parallel wavelength channels. This is where the comb-driven DWDM architecture can really help. For example, with 64 wavelength channels, we can do a MAC operation where each of these numbers has 32 bits.",
            "I have used a test board that we previously fabricated to validate this concept. The photonic chip has 8 microring resonators cascaded along the same waveguide. Each resonator can be electrically tuned, and the drop-port signal can be read from a transimpedance amplifier that's integrated on the same board.",
            "Here, I am showing an example where I played with the number of ones and get the reading from the analog photodetector. The voltage levels are quite distinct, because the resonators operate in a binary fashion and their extinction ratios are very high. On the right, I am showing the result of using this voltage, after some amplification, to drive the photonic ADC bus. And we can see that different rings will cross this flipping threshold at a different voltage level, and this is how we can convert the analog signal back into digital.",
            "And in our next tape-out run, which will happen in February, I am working on putting down a dedicated chip design that has the two functionalities combined. And, I am very hopeful that it will make a cool system demonstration of this photonic-enabled computing architecuture.",
            "\\textbf{Future}",
            "Now, let me talk about the future.",
            "One exciting extension of my work is to use heterogeneous integration technologies to build a computing node that has an integrated comb source, and the photonic components are directly driven by the computing or the memory chip. My preliminary link budget analysis shows that this approach is promising for at least another ten times greater energy efficiency by eliminating the overhead from the driver circuitry altogether.",
            "A little further into the future, I am also interested in exploring the possibility of doing optical routing in the 3rd dimension. This breaks away from the density limitations of today's planar optical routing. It also enables a new connectivity paradigm where more chips can be integrated onto a big photonic substrate, and can be potentially very useful for enabling wafer-scale or panel-scale computing.",
            "Another exciting direction is to accelerate the computation tasks through network-application co-design. Because, If the computation can be done in a fraction of the time it takes today, there is going to be a great amount of energy saving from the computing side, in addition to the energy saving from data movement itself.",
            "And additionally, I plan to look at how photonic technologies can be applied to more applications, such as having a photnoic backend for large-scale distributed antenna arrays. By leveraging the bandwidth and data processing capabilities in photnoics, we can potentially scale up the number of antennas in an array by orders of magnitude.",
            "To pursue these directions, I think I will highly benefit from collorations with the faculty members at [School Name]. For example, [jump to question \\ref{q5}]",
            "With that I would like to thank you for having me here today, and I am happy to take any questions you may have."
          ]
        },
        {
          "employers": ["UMN-v0"],
          "answerPoints": [
            "My research addresses the communication bottleneck in modern computing systems. The grand challenge arises from the exponential growth of data-intensive applications, such as artificial intelligence and machine learning. As this figure shows, the size of AI models has been growing nearly an order of magnitude per year, and is far beyond what any single computing node can host. This means that massive data must be communicated between numerous computing nodes, efficiently. What's equally astonishing is the energy associated with these computations. And just to put it in some perspective, the estimated energy used for training the GPT-4 model can power the entire New York City in a hot summer day for more than one hour. And a growing portion of this energy is spent on data movement.",
            "This is because existing interconnect technologies, whether electrical or optical, are limited in bandwidth density and energy efficiency, especially over longer distances. So, my research approaches this challenge from two angles. First, I use integrated silicon photonics to equip computing chips with high-bandwidth and energy-efficient data communication capabilities. Second, I explore the use of silicon photonics to perform computing tasks while data is in motion.",
            "The first piece of work that I will go over today aims to bring photonic connectivity all the way into the computing socket. In this way, we can eliminate the long electrical wires, because data gets converted into the optical domain right at where it is generated. To fit everything into such a small form factor, this work leverages two key factors: 1) comb-driven DWDM, which stands for dense wavelength-division multiplexing, and 2) tight 3D integration of photonics and electronics.",
            "Wavelength-division multiplexing is perhaps one of the most well-known advantages of sending signals with light, because we can put these signals on different wavelengths and let them propagate in the same waveguide or fiber. And then, we can use a structure called a microresonator to modulate or filter each of these wavelengths without affecting the others. One of the unique features of this work is that, it is designed to work with a Kerr frequency comb source. This is a device that can generate tens of wavelength channels from a single laser source. We then designed a scalable link architecture that can increase the number of parallel channels per link to 64 and beyond. This is four times higher than the best-in-class commercial solutions. What it really enables is that each channel can now operate at a much lower data rate, which consumes significantly less power.",
            "Besides the link design, another big part of this work is the integration and packaging. Here, I led the design of this photonic integrated circuits, or PIC. It integrates over 2000 microresonator devices within this 8 by 8 mm chip. The photonic devices are driven by an electronic integrated circuit, or EIC, designed at Cornell University. As shown here, the PIC and EIC are flip-chip bonded. And then, three pairs of PIC and EIC are further co-packaged with a compute chip. This packaging is done at Intel through close collaboration among the three teams. It promises a 96\\,Tbps bidirectional bandwidth with a 4\\,Tbps/mm bandwidth density. And all these come with an energy consumption of less than 1\\,pJ/b, thanks to the massive wavelength parallelism of the link architecture.",
            "Here is a comparison of this work to the state-of-the-art. The y-axis is the link figure of merit, plotted against the number of parallel channels per Tera bit of bandwidth. The more right on the x-axis, the \\emph{more} parallel channels operating at a \\emph{lower} speed. It shows that the link FOM significantly benefits from the use of a moderate data rate per channel. Overall, this work represents a two-order-of-magnitude improvement in link FOM over the state-of-the-art. An immediate future extension of this work is to further push the link FOM through heterogeneous integration. For example, my preliminary link budget analysis shows that another order of magnitude improvement is possible if the comb source can be integrated onto the silicon photonics chip to reduce loss.",
            "There are also exciting implications for future computing systems. Since our modulators are optimized for ultra-low driving voltages down to 0.2\\,V, it becomes possible to directly drive the photonic components with the computing or memory chip. This avoids any overhead from the serializers, deserializers, or even the driver circuitry altogether.",
            "With the high bandwidth available at all distances, it also opens up possibilities for new computation models where data locality is no longer a contraints. We can look into network-application co-design to accelerate large-scale computation tasks. Imagine the energy saving if the computation can be done in a fraction of the time it takes today. And this is in addition to the energy saving from the data movement itself."
          ]
        },
        {
          "employers": ["WashU"],
          "answerPoints": [
            "My research is largely motivated by the observation that data movement has become an integral part of computation in today's large-scale computing systems, and I aim to equip the system connectivity with both \\emph{efficient} and \\emph{functional} data movement, which I will go into a bit more details in my later slides, and ultimately unleash the potential for new computing paradigms.",
            "The recent growth of data-intensive applications, such as AI/machine learning, is tremendous, and it requires massive amount of data to be communicated between distributed computing nodes. What's equally significant is the energy associated with the computation. To put it in some perspective, the estimated energy used for training the GPT-4 model can power the entire New York City in a hot summer day for more than one hour. And a growing portion of this energy is spent on data movement, because electrical interconnects face challenges in terms of bandwidth and energy efficiency, especially over long distances. If we look at a figure of merit which is the link bandwidth density times energy efficiency, we can see that electrical interconnects are super good at short distances, but as they go further, the figure of merit drops rapidly. Existing optical solutions, which are essentially the pluggable optical transceivers, do not escape from this trend either, because they were simply not designed for density or energy efficiency.",
            "So, a large part of my research focuses on using integrated silicon photonics to address this challenge by providing distance-agnostic, high-bandwidth connectivity between computing nodes. Beyond addessing the efficiency of data movement, my work also extends to integrating processing and computing functionalities directly within data movement\\textemdash{}essentially enabling computation while data is in motion.",
            "The approach that I take, is to mainly leverage two key factors: 1) wavelength parallelism\\textemdash{}while this is the inherent benefit of communicating with light, here we are targeting 64, or even up to 128 channels per link, uniquely leverging a Kerr comb source, so each channel can really benefit from a moderate data rate that is achievable with low-power electronic drivers, and 2) tight 3D integration of photonics and electronics\\textemdash{}this is to really minimize the extra wiring between the compute unit and the E/O conversion interface which, in today's optical solutions, is usually far away. One of the most significant results along this line was delivered as part of the DARPA PIPES program where I led the development of a photonic I/O chiplet that can be 3D integrated with an electronic driver chiplet and co-packaged with a compute chip, and features 96\\,Tbps bidireciontal bandwidth per package with a 4\\,Tbps/mm shoreline bandwidth density and consumes less than 1\\,pJ/b. This represents a two-order-of-magnitude improvement in link figure of merit over the state-of-the-art.",
            "So, a natural future extension along this line is to leverage two of our key findings / achievements: 1) we can potentially have hundreds of parallel optical channels operating at a moderate data rate like 16\\,Gbps. and 2) our modulators are optimized for ultra-low driving voltages down to about 0.2\\,V. This opens up the possibility of having the optical components directly driven by the I/O pins of the compute or memory chip, completely eliminating the need for serializers/deserializers by matching the electronic and photonic data rates.",
            "In the second line of my research, I focused on leveraging the massive wavelength parallelism to enable computing functionalities within the optical domain, while data is in motion. One example here is an architecture that we will present at OFC this year, which is similar to the wavelength-parallel link architecture but tailored to accelerating multiply-accumulate (MAC) operations, which are fundamental to AI and machine learning workloads. Many of the traditional approaches to photonic computing often encode data into analog optical properties, such as phase or intensity, which is limited in bit precision and prone to fabrication and environmental variations. Instead, in our approach, we assign each bit place of the MAC result a unique wavelength, and each resonant modulator only operates in a binary fashion, either on or off, making this architecture more robust and scalable. The task of improving bit precision is delegated to increasing the number of parallel wavelength channels, which is where our comb-driven DWDM architecture becomes attractive.",
            "Moving foward along this direction, I imagine that we can potentially have an optically connected memory architecture where photonic accelerators are directly integrated into the optical I/O and interfaced with the memory controller. It also opens up the possibility of new system models designed around the idea that instead of fetching data from the memory, we are fetching the computation results and in a more efficient way than today's solutions. Moreover, we can think of applying the photonic backend to other applications, such as large antenna arrays where electrical signal processing are near its limits, and perhaps an optical communication backend with built-in computing functionalities can enhance its scalability and efficiency.",
            "I also look forward to exploring new directions that can be made possible by further leveraging heterogeneous integration. By exploring new materials and advanced packaging, we can aim to further push the limits of circuit/system performance, as well as enable new functionalities that are otherwise not possible with monolithic integration. For example, glass substrate can be a potential alternative to silicon for photonic integration, with panel size even larger than silicon wafers, great resistance to warpage during packaging, and transparency to light, which makes it attractive for achieving optical routing through the substrate. A particularly exciting future direction is thus to explore a new paradigm of chip-to-chip connectivity that lifts the restrictions of today's planar optical routing. Here, I envision a dense 3D optical system architecture, which enables any-to-any interconnections from waveguide arrays on an active chip to those on another active chip through an interposer-like routing chip, where data stays in the optical domain throughout. This would open up many collaboration opportunities across the system stack, including device, packaging, integration, compute architecture, and design automation, in order to build around this new paradigm an optimized system for future computing.",
            "Another direction that I think are becoming increasingly important to integrated photonic systems as they become larger and more complex is to develop digital twins of the photonic systems. As my PhD background in electronic-photonic design automation had told me, you cannot detach system design from physical models of devices and circuits. This is particularly critical for heterogeneous integration, where diverse material platforms and fabrication processes introduce complexities that can benefit from holistic modeling. By incorporating digital twins into the design flow, we can potentially enable more efficient and accurate design space exploration and reduced design cycles.",
            "In summary, I aim to design integrated photonic systems where optical interconnects are not just high-bandwidth communication channels but also platforms for distributed computing, and I look forward to collaborating with the faculty here to develop an ecosystem around this vision."
          ]
        }
      ],
      "askedBy": [
        {
          "name": "UMN",
          "date": "1/14/2025"
        },
        {
          "name": "Clemson",
          "date": "1/22/2025"
        }
      ]
    },
    {
      "question": "Most significant work and why.",
      "prepAnswers": [
        {
          "employers": ["WashU"],
          "answerPoints": [
            "I consider the development of the 3D integrated DWDM photonic I/O chiplet as my most significant contribution. This work directly addresses the imminent problem of communication bottlenecks in modern computing systems, where the ever-increasing demands of AI and data-intensive applications have outpaced the capabilities of traditional electrical interconnects. Without addressing this bottleneck, the scalability of future computing systems is fundamentally limited.",
            "The solution\\textemdash{}leveraging massive wavelength parallelism for distance-agnostic, high-bandwidth, and energy-efficient connectivity\\textemdash{}is technically feasible but still requires 5\\textendash{}10 years of refinement to achieve widespread adoption in my opinion. Key areas such as laser integration and advanced packaging need further maturation. However, the potential impact is high: achieving energy-efficient communication at all distances can unlock new possibilities for distributed computing and AI systems.",
            "What sets this work apart is the co-design approach. This project required a deep integration of expertise across multiple domains\\textemdash{}comb source, photonic link architecture and chiplet design, electronic driver design, and advanced packaging. The co-design effort underscores the importance of interdisciplinary collaboration, as well as aligning system-level design choices with device-level specifications."
          ]
        },
        {
          "employers": [
            "Rice",
            "ASU-Microelectronics",
            "ASU-Packaging",
            "RIT-Photonics",
            "Clemson"
          ],
          "answerPoints": [
            "My most significant work is the design of an integrated photonic chip that provides high-bandwidth and energy-efficient data input/output to computing chips. This work is significant because it directly addresses the communication bottleneck in today's computing systems, where the communication links are consuming too much energy to provide not even enough bandwidth. And this bottleneck is causing a slowing down of a wide spectrum of large-scale computational tasks like AI, machine learning, scientific computation, digital twins, defense applications and so on.",
            "So, this photonic chip that I designed goes into the same package as the computing chip, and this package can deliver a 96\\,Tbps bidirectional bandwidth with a 4\\,Tbps/mm bandwidth density, and consumes less than 1\\,pJ/b. So if we multiply this bandwidth density with the energy efficiency, we get a metric that is two orders of magnitude higher than today's state-of-the-art, like for example, the Ayarlabs' solutions. The key technologies that enabled this high bandwidth density and energy efficiency are A) massive wavelength parallelism\\textemdash{}this is achieved through the use of an optical frequency comb source and a scalable link architecture, and B) 3D integration of electronics and photonics.",
            "So, what are some of the potential applications of my work? Well first, with this high bandwidth available, we can really think of how we can reconfigure the network, and re-allocate the bandwidth toward where it is needed, during application execution. So this will initiate some network-application co-design, and hopefully, we can accelerate the computation tasks through co-optimizing the system design. Because, if the application can be executed in a fraction of the time it takes today, there is going to be a huge amount of energy saving from the computing side, in addition to the energy saving from data movement itself.",
            "We can also think of new architectures for optically connected computing resources or memory. In our experiment, we have achieved ultra-low driving voltages for our photonic modulators, down to 0.2\\,V. This means that we can potentially drive them directly with the I/O pins of the computing or memory chip, and matching the data rate between the electronics and the photonics. So hopefully this approach can eliminate the overhead from the driver circuitry altogether.",
            "\\textbf{More technical details:} Massive wavelength parallism. So, it's probably well-known that using light, you can encode data onto different wavelengths and let them propagate in the same waveguide or fiber. But by massive parallelism, I mean that we are increasing this number of parallel wavelengths from today's less than 16 per fiber, to greater than 64. So, one of the key enabling technology is called an optical frequency comb source. This is a device that can generate tens to even hundreds of evenly spaced frequency channels from a single laser. This high channel count is not feasible if we use one individual laser for each channel. And then, I also designed a scalable link architecture that can actually support these many channels on a single chip. So this is achieved by using a special interleaving and de-interleaving structure, which can subdivide the comb channels onto several waveguide buses, using a series of microresonator modulators to modulate them, and recombine them into the same fiber output after modulation.",
            "Another key part is the integration and packaging. And this is where a lot of the co-design effort, and collaborations with a lot of different groups, come into play. So this photonic chip that I designed is roughly 8mm by 8mm, and it integrates over 2000 photonic components on it. So they have to be controlled by an electronic chip, designed by another university group, that is 3D integrated onto the photonic chip. And then, this pair of electronic-photonic chip assembly, is further packaged with an FPGA chip using Intel's packaging capabilities."
          ]
        }
      ],
      "askedBy": [
        {
          "name": "WashU",
          "date": "1/10/2024"
        }
      ]
    },
    {
      "question": "More future plans / opportunities in the field.",
      "prepAnswers": [
        {
          "employers": ["WashU"],
          "answerPoints": [
            "Mentioned: direct-drive by compute/memory chip, photonics-enabled computing for AI/ML, photonics for RF signal processing, heterogeneous integration, digital twins.",
            "Reconfigurable optical interconnects adapting to traffic demands. Emerging applications cause network traffic patterns to be heterogeneous and highly dynamic. A cost-effective trade-off can accommodate most typical cases without insanely increase the overhead for supporting all reconfigurations. Considering a lot of AI/ML applications can benefit from multicasting, e.g., matrix vector multiplication, efficiently supporting multicast in the optical domain is a key feature.",
            "Look at LEDs for short-reach data communication. Low-power, low-cost, long-lifetime, redundancy, fast turn-on/off for reconfiguration, energy proportionality.",
            "Fabrication-robustness, thermal management, athermal design."
          ]
        },
        {
          "employers": [
            "Rice",
            "ASU-Microelectronics",
            "RIT-Photonics",
            "Clemson"
          ],
          "answerPoints": [
            "Besides the onces I mentioned, I am also interested in finding applications for photonic connectivity in a broader range of systems. For example, I am interested in exploring the possibility of using photonic technologies to enable large-scale distributed antenna arrays. By leveraging the bandwidth and data processing capabilities in photonics, we can potentially scale up the number of antennas in an array by orders of magnitude. This can be particularly useful for applications like 5G and beyond, where the number of antennas is expected to grow significantly.",
            "I'm also interested in exploring the possibility of routing optical signals in the 3rd dimension. This breaks away from the density limitations of today's planar optical routing, and enables a new connectivity paradigm where more chips can be integrated onto a big photonic substrate. This can be particularly useful for enabling wafer-scale or panel-scale computing, where more chips can be integrated onto a single substrate, and can be potentially very useful for applications like AI and machine learning, where the amount of data that needs to be processed is growing exponentially."
          ]
        },
        {
          "employers": ["ASU-Packaging"],
          "answerPoints": [
            "Besides the one I mentioned, 3D photnoics, I'm also interested in exploring new architectures for optically connected computing resources or memory. In our experiment, we have achieved ultra-low driving voltages for the photonic modulators, down to 0.2\\,V. This means that we can potentially drive them directly with the I/O pins of the computing or memory chip, and matching the data rate between the electronics and the photonics. So hopefully this approach can eliminate the overhead from the driver circuitry altogether. And by integrating laser sources onto the photonics chip, we can significantly lower the optical losses. And my preliminary link budget analysis shows that this approach is promising for at least another ten times greater energy efficiency, combining the benefits from integrated laser and ultra-low driving voltage.",
            "I am also interested in finding applications for photonic connectivity in a broader range of systems. For example, I am interested in exploring the possibility of using photonic technologies to enable large-scale distributed antenna arrays. By leveraging the bandwidth and data processing capabilities in photonics, we can potentially scale up the number of antennas in an array by orders of magnitude. This can be particularly useful for applications like 5G and beyond, where the number of antennas is expected to grow significantly."
          ]
        }
      ],
      "askedBy": [
        {
          "name": "WashU",
          "date": "1/10/2024"
        }
      ]
    },
    {
      "question": "Potential collaboration.",
      "prepAnswers": [
        {
          "employers": ["WashU"],
          "answerPoints": [
            "Lan Yang: optoelectronic devices and materials",
            "Mark Lawrence: metasurfaces",
            "Roger Chamberlain: application-specific computing architecture design.",
            "Shantanu Chakrabartty: energy-efficient computing, analog computing for AI."
          ]
        },
        {
          "employers": ["Rice"],
          "answerPoints": [
            "I think my research bridges the gap between devices and systems, so I would highly benefit from collaborations on both ends. For example, I would really appreciate the expertise from Prof. Shengxi Huang and Prof. Yuji Zhao on optoelectronics and heterogeneous integration. And on the architecture and system side, I would be honored to work with the experts in network and computing systems like Prof. Peter Varman and Prof. Eugene Ng."
          ]
        },
        {
          "employers": ["ASU-Microelectronics"],
          "answerPoints": [
            "I highly value the opportunity to collaborate with the faculty members at ASU. And because the research area at ASU is so diverse, I am really excited about the potential for interdisciplinary collaborations. For example, I would highly value the expertise from Prof. Frank Fan in incorporating new materials into photonic platforms, such as phase-change materials for reconfigurable photonics and photonic computing. I would also highly benefit from Prof. Zeinolabedinzadeh's expertise in electronic-photonic integration, and explore applications in photonics for RF. I would be excited to work with Prof. Chakrabarty to use heterogeneous integration to enable new computing paradigms. I also look forward to working with Prof. Chhabria on design automations for these growingly complex electronic-photonic systems, building models, or they now like to call it, digital twins, for the system stack. And I think I would also highly benefit from the packaging capabilities that will be built through the SHIELD USA program, and also the vecinity of the ASU campus to the new TSMC foundry."
          ]
        },
        {
          "employers": ["ASU-Packaging"],
          "answerPoints": [
            "I highly value the opportunity to collaborate with the faculty members at ASU. And because the research area at ASU is very diverse, I am really excited about the potential for interdisciplinary collaborations. For example, I would highly apprecicate collaborating with Prof. Frank Fan in incorporating new materials into photonic platforms, such as phase-change materials for reconfigurable photonics and photonic computing, with Prof. Zeinolabedinzadeh in electronic-photonic integration, with Prof. Kitchen to explore applications of photonics in RF, with Prof. Chakrabarty to use heterogeneous integration to enable new computing paradigms. I also look forward to working with Prof. Bailey on modeling these growingly complex integrated systems, or they now like to call it, making digital twins, for the manufacturing stack. And I think I would also highly benefit from the packaging capabilities that will be built through the SHIELD USA program, and also the vecinity of the ASU campus to the new TSMC foundry."
          ]
        },
        {
          "employers": ["RIT-Photonics"],
          "answerPoints": [
            "I highly value the opportunity to collaborate with the faculty members at RIT and I am really excited about the potential for interdisciplinary research. For example, I would highly apprecicate collaborating with Prof. Jing Zhang in exploring the use of, for example, LED sources, for short-reach data communication; with Prof. Preble in exploring heterogeneous integration and advanced packaing for photonic systems, such as laser integration. More toward the computing architecture/system side, I would highly benefit from the expertise of Prof. Das and Prof. Kim regarding emerging computing paradigms for AI and machine learning."
          ]
        },
        {
          "employers": ["Clemson"],
          "answerPoints": [
            "I highly value the opportunity to collaborate with the faculty members at Clemson and I am really excited about the potential for interdisciplinary research. For example, I would highly apprecicate collaborating with Prof. Zhu for his expertise in on-chip laser integration; with Prof. Judson in exploring the use of, for example, phase-change materials for reconfigurable photonics. More toward the architecture/system side, I would highly benefit from the expertise of Prof. Kuang-Ching Wang and Prof. Melissa Smith to explore the best use of photonic technologies in cloud computing. I would also love to work with Prof. Wei on topics including photonic design automation."
          ]
        }
      ],
      "askedBy": [
        {
          "name": "WashU",
          "date": "1/10/2024"
        }
      ]
    },
    {
      "question": "Funding plan.",
      "prepAnswers": [
        {
          "employers": ["WashU"],
          "answerPoints": [
            "I think a lot will be joint proposals with faculty especially for large projects. I have helped write proposals for NSF, DARPA, DOE, SRC, some regional funding agencies, and industry. I think the most important proposal that I need to develop for my own is a CAREER proposal for NSF. Industry fundings are also a good source for some applied research topics. I think the most important is to write as many as I can, proactively reach out to program managers, and keep a good track record of delivering results."
          ]
        },
        {
          "employers": [
            "ASU-Microelectronics",
            "ASU-Packaging",
            "RIT-Photonics",
            "Clemson"
          ],
          "answerPoints": [
            "I plan to seek funding from both federal agencies, like NSF, DARPA, DOE, and industry companies like samsung, applied materials, and consortiums of both, like SRC. Those are some that I have helped write proposals for. And I think a lot of these proposals will be joint proposals especially for large program calls, one of the most important ones that I will work hard to develop is the NSF CAREER proposal. And I think in general the best practice is to write as many as I can, proactively reach out to program managers, and keep a good track record of delivering results."
          ]
        }
      ],
      "askedBy": [
        {
          "name": "WashU",
          "date": "1/10/2024"
        }
      ]
    },
    {
      "question": "Teaching experience and interests.",
      "prepAnswers": [
        {
          "employers": ["WashU"],
          "answerPoints": [
            "Undergrad: embedded systems and its lab component, digital logic.",
            "Grad: guest lecturing my supervisor's course; research related.",
            "Can teach: undergrad core courses such as circuits, digital logic, embedded systems, fiber optics including lab components, and grad courses on integrated photonics, optical communication.",
            "Open to teach: related field helpful to my own knowledge, such as computer architecture, VLSI",
            "Can develop: new courses on optical interconnects, photonics-enabled computing, photonic design automation."
          ]
        },
        {
          "employers": ["ASU-Microelectronics"],
          "answerPoints": [
            "I'll be interested in teaching both undergraduate and graduate level courses. I recognize that ASU is a big school, so it'll be challenging but it'll be an exciting challenge to teach there. And I think it is a great platform to produce the next generation of workforce in the field of semiconductor.",
            "So, some of the undergraduate level courses that I can teach include courses like semiconductor devices, digital logic, fiber optics, including lab components. And at the graduate level, I could think of integrated photonics, optical communication, electronic-photonic design automation.",
            "I'll also be open to teach related fields that are helpful to my own knowledge and research, like VLSI"
          ]
        },
        {
          "employers": ["ASU-Packaging"],
          "answerPoints": [
            "I'll be interested in teaching both undergraduate and graduate level courses. I recognize that ASU is a big school, so it'll be challenging but it'll be an exciting challenge to teach there. And I think it is a great platform to produce the next generation of workforce in the field of semiconductor.",
            "So, some of the undergraduate level courses that I can teach include courses like semiconductor devices, digital logic, circuit design, and VLSI. More related to my field like fiber optics, including lab components. And at the graduate level, I could think of integrated photonics, optical communication, electronic-photonic design automation. There is one component that I really hope to bring into the integrated photonics course, which is to include hands-on experiences to actually design and tape-out a photonic chip using MPW runs, like some of the electrical circuits courses already have. This might be further down the road as it involves a lot of logistics, working with a foundry, funding for the MPW runs, and so on, but I am really interested in exploring the possibilities here."
          ]
        },
        {
          "employers": ["RIT-Photonics"],
          "answerPoints": [
            "I'll be interested in teaching both undergraduate and graduate level courses. And I think, RIT, being in upper state New York, is a great platform to produce the next generation of workforce in the field of semiconductor manufacturing and integrated photonics.",
            "So, some of the undergraduate level courses that I can teach include courses like semiconductor devices, circuit design, digital logic, and VLSI. More related to my field like fiber optics, including lab components. And at the graduate level, I could think of integrated photonics, optical interconnects, electronic-photonic design automation. There is one component that I really hope to bring into the integrated photonics course, and I think Prof. Preble must have a lot of experience to share, which is to include hands-on experiences to actually design and tape-out a photonic chip using MPW runs, like some of the electrical circuit courses already have. This might be further down the road as it involves a lot of logistics, working with a foundry, funding for the MPW runs, and so on, but I am really interested in exploring the possibilities here."
          ]
        },
        {
          "employers": ["Clemson"],
          "answerPoints": [
            "I'll be interested in teaching both undergraduate and graduate level courses. And I believe it is the utmost important way to produce the next generation of workforce in the field of circuits and integrated photonics.",
            "So, some of the undergraduate level courses that I can teach include courses like semiconductor devices, circuit design, digital logic, and VLSI. More related to my field like fiber optics, including lab components. And at the graduate level, I could think of integrated photonics, optical interconnects, electronic-photonic design automation. There is one component that I really hope to bring into the integrated photonics course, which is to include hands-on experiences to actually design and tape-out a photonic chip using MPW runs, like some of the electrical circuit courses already have. This might be further down the road as it involves a lot of logistics, working with a foundry, funding for the MPW runs, and so on, but I am really interested in exploring the possibilities here."
          ]
        }
      ],
      "askedBy": []
    }
  ]
}
